# Тип заданий №2
## №26974
Логическая функция F задаётся выражением (x ∨ y) ∧ ¬(y ≡ z) ∧ ¬w. 
На рисунке приведён частично заполненный фрагмент таблицы истинности функции F,
содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности 
функции F соответствует каждая из переменных x, y, z, w.

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им 
столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
~~~
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if (x or y) and not(y == z) and not w:
                    print(x, y, z, w)
~~~
Ответ: xzyw
## №33174
Логическая функция F задаётся выражением ((x → y) ≡ (w → x)) ∧ (z → w). 
На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, 
содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности 
функции F соответствует каждая из переменных x, y, z, w.

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы 
(сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
~~~
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((x <= y) == (w <= x)) and (z <= w):
                    print(x, y, z, w)
~~~
Ответ: yzwx

## №83132
Миша заполнял таблицу истинности логической функции F
(¬x ∧ z ∧ ¬y ∧ ¬w) ∨ (¬x ∧ z ∧ y ∧ ¬w) ∨ (¬x ∧ z ∧ y ∧ w),
но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных w, x, y, z.

В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы 
(сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
~~~
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if (not(x) and z and not(y) and not(w)) or (not(x) and z and y and not(w)) or (not(x) and z and y and w):
                    print(x, y, z, w)
~~~
Ответ: xywz

# Тип заданий №8
## №55625
Ярослав составляет коды из букв, входящих в слово ЯРОСЛАВ. Код должен состоять из 5 букв, буквы в коде не должны повторяться, 
согласных в коде должно быть больше, чем гласных, две гласные буквы нельзя ставить рядом. Сколько кодов может составить Ярослав?
~~~
s = 'ЯРОСЛАВ'
count = 0
for j in s:
    for k in s:
        for l in s:
            for m in s:
                for n in s:
                    s1 = j + k + l + m + n
                    if s1.count('Я') <= 1 and s1.count('Р') <= 1 and s1.count('О') <= 1 and \
                        s1.count('С') <= 1 and s1.count('Л') <= 1 and s1.count('А') <= 1 and \
                        s1.count('В') <= 1 and \
                        s1.count('Р') + s1.count('С') + s1.count('Л') + s1.count('В') > s1.count('Я') + s1.count('О') + s1.count('А') and \
                        s1.count('ЯО') == 0 and s1.count('ЯА') == 0 and s1.count('ОА') == 0 and s1.count('ОЯ') == 0 and s1.count('АЯ') == 0 and s1.count('АО') == 0:
                        count += 1
print(count)
~~~
Ответ: 1224
## №81474
Все шестибуквенные слова, составленные из букв Т, Е, О, Р, И, Я, 
записаны в алфавитном порядке и пронумерованы. Вот начало списка:

1.  EEEEEE

2.  ЕЕЕЕЕИ

3.  EEEEEO

4.  EEEEEP

5.  EEEEET

Определите, под каким номером в этом списке стоит последнее слово с нечётным номером, 
которое не начинается с букв Е, И или О и при этом содержит в своей записи ровно одну букву T.

~~~
s = 'ЕИОРТЯ'
count = 0
last_num = 0
for i in s:
    for j in s:
        for k in s:
            for l in s:
                for m in s:
                    for n in s:
                        count += 1
                        word = i + j + k + l + m + n
                        if word[0] not in 'ЕИО' and word.count('Т') == 1 and count % 2 == 1:
                            last_num = count
print(last_num)
~~~
Ответ: 46655

## №59744
Евгений составляет 6-⁠буквенные слова из букв М, У, Ж, Ч, И, Н, А. Каждая из букв может встречаться в слове ровно один раз, 
причём первой буквой не может быть Ч, буква Ж должна встречаться не менее 1 раза и номер слова должен быть нечётный.

Сколько различных слов может составить Евгений?

~~~
s = 'МУЖЧИНА'
count = 0
c1 = 1
for s1 in s:
    for s2 in s:
        for s3 in s:
            for s4 in s:
                for s5 in s:
                    for s6 in s:
                        bububu = s1 + s2 + s3 + s4 + s5 + s6
                        if bububu[0]!='Ч' and (bububu.count('Ж') == 1) and (bububu.count('М') < 2) and (bububu.count('У') < 2) and (bububu.count('Ч') < 2) and (bububu.count('И') < 2) and (bububu.count('Н') < 2) and (bububu.count('А') < 2):
                            if (c1 % 2) == 1:
                                count += 1
                            c1 += 1
print(count)
~~~
Ответ: 1860
