# Задание 1
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000;
20001], числа, имеющие ровно 5 различных делителей. Выведите эти делители для каждого найденного
числа в порядке возрастания.
~~~
# перебираем все числа от 10000 до 20001 включительно
for n in range(10000, 20002):
    count = 0  # счётчик делителей
    # считаем количество делителей числа n
    for d in range(1, n + 1):
        if n % d == 0:  # если d делит n без остатка
            count += 1
    # если делителей ровно 5, выводим число и его делители
    if count == 5:
        print("Число", n, "делители:", end=" ")
        # снова перебираем все числа, чтобы найти делители
        for d in range(1, n + 1):
            if n % d == 0:
                print(d, end=" ")  # выводим делитель
~~~
# Задание 2
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000;
12345], простые числа. Выведите сумму этих чисел.
~~~
total = 0  # сумма простых чисел
for n in range(10000, 12346):  # перебираем числа из отрезка
    prime = True  # сначала считаем число простым
    if n < 2:
        prime = False
    else:
        # проверяем делители от 2 до корня из n
        for d in range(2, int(n ** 0.5) + 1):
            if n % d == 0:
                prime = False  # нашли делитель - число составное
                break  # выходим из цикла, дальше проверять не нужно
    if prime:
        total += n  # добавляем простое число к сумме
print("Сумма простых чисел:", total)  # выводим результат
~~~
# Задание 3
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число
m». Для какого наибольшего натурального числа А формула:

(¬ДЕЛ(x, A) ∧ ДЕЛ(x, 4)) → ¬ДЕЛ(x, 9)

тождественно истинна (т.е. принимает значение 1 при любом натуральном значении переменной x)?
Напишите программу для решения данной задачи.
~~~
# перебираем A от 100 вниз до 1 (ищем наибольшее)
for A in range(100, 0, -1):
    ok = True  # предполагаем, что A подходит
    # проверяем разные x (достаточно до 1000)
    for x in range(1, 1000):
        # условие, при котором формула может быть ложной:
        # x не делится на A, но делится на 4 и на 9
        if (x % A != 0) and (x % 4 == 0) and (x % 9 == 0):
            ok = False  # нашли контрпример
            break  # выходим из цикла по x
    if ok:
        print("Наибольшее A:", A)
        break  # нашли наибольшее подходящее A, завершаем поиск и показывае наибольшее 
~~~
# Задание 4
Для какого наименьшего числа А формула:

(x > 15) ∨ (x < 2y) ∨ (A > x+y)

тождественно истинна для любых целых положительных значений x и y. Напишите программу для
решения данной задачи.
~~~
# перебираем A
for A in range(1, 100):
    ok = True
    # проверяем все положительные x и y (до 100 достаточно)
    for x in range(1, 100):
        for y in range(1, 100):
            # если все три условия ложны, формула ложна
            if not ((x > 15) or (x < 2 * y) or (A > x + y)):
                ok = False
                break  # выходим из цикла по y
        if not ok:
            break  # выходим из цикла по x
    if ok:
        print("Наименьшее A:", A)
        break  # нашли наименьшее подходящее A и стопим это добро еееееееее дэм
~~~
# Задание 5
Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Строится двоичная запись числа N.
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается
остаток от деления полученной суммы на 2.
3. Предыдущий пункт повторяется для записи с добавленной цифрой.
4. Результат переводится в десятичную систему и выводится на экран.
 
Пример. Дано число N = 35. Алгоритм работает следующим образом:
1. Двоичная запись числа N: 100011.
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111.
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110.
4. На экран выводится число 142.
Какое наибольшее число, меньшее 100, может появиться на экране в результате работы автомата?
~~~
max_res = 0  # переменная для хранения максимального результата
             # перебираем все возможные входные числа N от 1 до 99
for N in range(1, 100):  # перебираем все возможные N
    binary = bin(N)[2:]  # двоичная запись N (без префикса '0b')
    # дважды добавляем остаток от деления суммы цифр на 2
    for _ in range(2):
        s = binary.count('1')  # сумма цифр (количество единиц)
        binary += str(s % 2)    # дописываем остаток (0 или 1)
    res = int(binary, 2)        # переводим полученную двоичную строку в десятичное число
    # если результат меньше 100 и больше текущего максимума
    if res < 100 and res > max_res:
        max_res = res            # запоминаем новый максимум
print("Наибольшее число < 100:", max_res)  # после перебора всех N выводим наибольший найденный результат
~~~
# Задание 6
Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Строится двоичная запись числа N.
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается
остаток от деления полученной суммы на 2.
3. Предыдущий пункт повторяется для записи с добавленной цифрой.
4. Результат переводится в десятичную систему и выводится на экран.

Пример. Дано число N = 35. Алгоритм работает следующим образом:
1. Двоичная запись числа N: 1101.
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111.
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110.
4. На экран выводится число 142.
При каком наибольшем числе N алгоритм выведет число, меньшее 150?
~~~
# Алгорит работы похожий как и в задаче 5, это так к словуZ
max_N = 0  # переменная для хранения наибольшего подходящего N
for N in range(1, 100):  # рассматриваем все возможные N
    binary = bin(N)[2:]  # двоичная запись числа N
    # дважды выполняем добавление остатка от суммы цифр
    for _ in range(2):
        s = binary.count('1')  # сумма цифр (количество единиц)
        binary += str(s % 2)   # дописываем остаток (0 или 1)
    res = int(binary, 2)       # итоговое десятичное число
    # если результат меньше 150, проверяем, не больше ли текущее N предыдущего максимума
    if res < 150 and N > max_N:
        max_N = N  # обновляем максимум
print("Наибольшее N:", max_N) # Ну и дай бог правельный релультат будет "Хотьбы повезло С***"
~~~
